
[/Script/GameplayTags.GameplayTagsSettings]
ImportTagsFromConfig=True
WarnOnInvalidTags=True
FastReplication=False
NumBitsForContainerSize=6
NetIndexFirstBitSegment=16
+GameplayTagList=(Tag="Collision",DevComment="接触時の処理を判定するためのタグ")
+GameplayTagList=(Tag="Collision.Clear",DevComment="接触するとクリア")
+GameplayTagList=(Tag="Collision.Damage",DevComment="接触時ダメージ")
+GameplayTagList=(Tag="Collision.End",DevComment="接触するとゲームオーバー")
+GameplayTagList=(Tag="Collision.Follow",DevComment="")
+GameplayTagList=(Tag="Collision.Get",DevComment="")
+GameplayTagList=(Tag="Collision.Stop",DevComment="接触すると速度が0になる")
+GameplayTagList=(Tag="ObjectType",DevComment="ゲーム内オブジェクトの分類")
+GameplayTagList=(Tag="ObjectType.Planet",DevComment="オブジェクトタイプ：惑星")
+GameplayTagList=(Tag="ObjectType.Player",DevComment="")
+GameplayTagList=(Tag="ObjectType.Spacecraft",DevComment="宇宙探査機(操作キャラクター)")
+GameplayTagList=(Tag="ObjectType.Station",DevComment="宇宙ステーション(スタートもしくはゴール)")


